cocktail-bar/app/views/cocktails/add_ingredient_form.html.erb

  <%= form_tag(category_cocktail_add_ingredient_path(id: @cocktail.id), method: :post, class: 'form') do %>
    Ingredient: <%= select_tag "ingredient", options_from_collection_for_select(Ingredient.all.sort { |a,b| a.name <=> b.name }, "id", "name"), class: 'category_select' %><br>
---
SELECT "ingredients".* FROM "ingredients"