cocktail-bar/app/views/cocktails/cocktail_form.html.erb

SELECT "categories".* FROM "categories"
---
      <div id="category-list">
        Category: <%= select_tag :new_cocktail_category, options_from_collection_for_select(Category.all, "id", "name"), class: 'category_select' %><br>