cocktail-bar/app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories"
---
  def index
    @hide = true
    @categories = Category.all