cocktail-bar/app/controllers/cocktails_controller.rb

  def search
    if params[:search]
      @search_result = Cocktail.all.filter do |cocktail|
        cocktail.name.downcase.include?(params[:search].to_s.downcase) || cocktail.ingredients.any? do |ingredient|
          ingredient.name.downcase.include?(params[:search].to_s.downcase)
---
SELECT "cocktails".* FROM "cocktails"
SELECT "ingredients".* FROM "ingredients" INNER JOIN "cocktails_ingredients" ON "ingredients"."id" = "cocktails_ingredients"."ingredient_id" WHERE "cocktails_ingredients"."cocktail_id" = ?  [["cocktail_id", 200]]
SELECT "ingredients".* FROM "ingredients" INNER JOIN "cocktails_ingredients" ON "ingredients"."id" = "cocktails_ingredients"."ingredient_id" WHERE "cocktails_ingredients"."cocktail_id" = ?  [["cocktail_id", 1]]

  def create
    @cocktail = @category.cocktails.build(name: params[:name], instructions: params[:instructions],
                                          picture: params[:picture])

    if @cocktail.save
---
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "cringe"], ["created_at", "2022-03-24 16:17:28.657101"], ["updated_at", "2022-03-24 16:17:28.657101"]]
INSERT INTO "cocktails" ("name", "picture", "category_id", "instructions", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def destroy
    @cocktail.destroy
---
DELETE FROM "cocktails" WHERE "cocktails"."id" = ?  [["id", 3]]

  def add_ingredient_form
    @category = Category.find(params[:category_id])
    @cocktail = @category.cocktails.find(params[:cocktail_id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "cocktails".* FROM "cocktails" WHERE "cocktails"."category_id" = ? AND "cocktails"."id" = ? LIMIT ?  [["category_id", 1], ["id", 7], ["LIMIT", 1]]

  def add_ingredient
    @cocktail = Cocktail.find(params[:id])
    new_ingredient = Ingredient.find(params[:ingredient])
    if @cocktail.ingredients.any? { |ingredient| ingredient == new_ingredient }
---
SELECT "cocktails".* FROM "cocktails" WHERE "cocktails"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = ? LIMIT ?  [["id", 149], ["LIMIT", 1]]
SELECT "cocktails".* FROM "cocktails" WHERE "cocktails"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create_category
    if params[:new_category]
      if Category.all.any? { |category| category.name == params[:category_name] }
        redirect_to :back, notice: 'There already exists a category with that name.'
      elsif Cocktail.all.any? { |cocktail| cocktail.name == params[:name] }
        redirect_to :back, notice: 'There already exists a cocktail with that name.'
      elsif !helpers.image_valid?(params[:picture])
        redirect_to :back, notice: 'The provided image url is not valid.'
      else
        @category = Category.create(name: params[:category_name])
        @category.save
      end
    else
      @category = Category.find(params[:new_cocktail_category])
---
SELECT "categories".* FROM "categories"
SELECT "cocktails".* FROM "cocktails" WHERE "cocktails"."category_id" = ? AND "cocktails"."id" = ? LIMIT ?  [["category_id", 1], ["id", 1], ["LIMIT", 1]]
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Test"], ["created_at", "2022-03-25 10:29:13.600717"], ["updated_at", "2022-03-25 10:29:13.600717"]]
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]

  def set_cocktail
    @cocktail = @category.cocktails.find(params[:id])
---
SELECT "cocktails".* FROM "cocktails" WHERE "cocktails"."category_id" = ? AND "cocktails"."id" = ? LIMIT ?  [["category_id", 9], ["id", 348], ["LIMIT", 1]]

  def set_category
    @category = Category.find(params[:category_id])
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]