cocktail-bar/app/controllers/ingredients_controller.rb

SELECT "cocktails".* FROM "cocktails" WHERE "cocktails"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def set_cocktail
    @cocktail = Cocktail.find(params[:cocktail_id])

SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
---
  def set_ingredient
    @ingredient = Ingredient.find(params[:id])